app.controller('allUserController',function ($scope,$http) {
    $http({
        method:'GET',
        url:'http://localhost:8080/allUsers'
    }).success(function (data) {
        $scope.allUsers=data;
    });

    /*var allUsers = [
        {
            'id':'1',
            'head':'1.jpg',
            'author':'刘淼',
            'introduce':'微信关注 jianshu333 ，定期抽大奖...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业？'
        },{
            'id':'2',
            'head':'2.jpg',
            'author':'philren',
            'introduce':'梅花网和明道创始人',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },{
            'id':'3',
            'head':'3.jpg',
            'author':'曹门霞客行',
            'introduce':'简书－上班这点事儿专题，官方主编，勾搭加微信...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },{
            'id':'4',
            'head':'4.jpg',
            'author':'毒舌电影',
            'introduce':'微信ID：dsmovie 公众号「毒舌电影...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },
        {
            'id':'5',
            'head':'5.jpg',
            'author':'梅珈瑞',
            'introduce':'写有意思的事儿，做有意思的人儿 保质不保量选...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },
        {
            'id':'6',
            'head':'6.jpg',
            'author':'天花板',
            'introduce':'从业多年的资深软件工程师一枚~ - 热...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },
        {
            'id':'7',
            'head':'7.jpeg',
            'author':'专三千',
            'introduce':'情不深才浅 话不少字垣 颜不高腿欠 身...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },
        {
            'id':'8',
            'head':'8.jpg',
            'author':'wind...',
            'introduce':'追剧不仅仅是为了娱乐，更是为了指导我们的生活...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },
        {
            'id':'9',
            'head':'9.jpg',
            'author':'简黛玉',
            'introduce':'黛玉每天在这里给各位推送简书好文章，请多多关...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        },{
            'id':'10',
            'head':'10.jpg',
            'author':'凉子菇娘',
            'introduce':'短篇小说副主编 公众号：十一号线 转载...',
            'new':'普通微信公众号如何一天群发两次？为什么微信会推出公众号粉丝迁移功能？互联网上的灰色产业'
        }
    ];
    $scope.allUsers=allUsers;*/
});